data32/ab_native505.dat
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        Apache/2.4.10
Server Hostname:        127.0.0.1
Server Port:            505

Document Path:          /
Document Length:        11321 bytes

Concurrency Level:      50
Time taken for tests:   3.738 seconds
Complete requests:      2500
Failed requests:        0
Total transferred:      28987500 bytes
HTML transferred:       28302500 bytes
Requests per second:    668.86 [#/sec] (mean)
Time per request:       74.754 [ms] (mean)
Time per request:       1.495 [ms] (mean, across all concurrent requests)
Transfer rate:          7573.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     2   74  12.0     76      89
Waiting:        2   74  12.1     76      89
Total:          5   74  11.8     76      89

Percentage of the requests served within a certain time (ms)
  50%     76
  66%     79
  75%     80
  80%     80
  90%     82
  95%     83
  98%     85
  99%     87
 100%     89 (longest request)